11/data/attachments/f93c6f0dab0edfde.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_864345ea-caba-4b45-ba99-f08823b7c9b5</nif:username>
            <nif:friendToBeAdded>Richard_first_Actions_62093_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>